TanaseDoru/FRDM_Pong/TestProjects/MKL25Z4_Display_My_test/source/MKL25Z4_Display_My_test.c
/*
 * MKL25Z4_Display_Test.c
 * Sistem de Meniu + Joc Pong Complet
 * ST7735 LCD + FRDM-KL25Z
 * Cu suport Joystick, IR Remote, si CPU Bot
 *
 * MODIFICAT: IR functioneaza in joc + Timere UI debug
 */

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "MKL25Z4.h"
#include "fsl_debug_console.h"
#include "fsl_uart.h"
#include "fsl_adc16.h"
#include "fsl_gpio.h"
#include "fsl_port.h"
#include "fsl_tpm.h"
#include "st7735_simple.h"

/*============================================================================
 * DEFINITII TIPURI INPUT SI ECRANE
 *============================================================================*/

typedef enum {
    INPUT_NONE = 0,
    INPUT_JOYSTICK,
    INPUT_REMOTE,
    INPUT_GYROSCOPE,
    INPUT_CPU_EASY,
    INPUT_CPU_MEDIUM,
    INPUT_CPU_HARD
} InputType_t;

typedef enum {
    SCREEN_INTRO = 0,
    SCREEN_MAIN,
    SCREEN_START,
    SCREEN_SELECT_INPUT,
    SCREEN_SELECT_P1,
    SCREEN_SELECT_P2,
    SCREEN_DIFFICULTY,
    SCREEN_GAMEPLAY,
    SCREEN_GAME_OVER,
    SCREEN_PAUSED
} Screen_t;

/*============================================================================
 * STRUCTURI PENTRU JOC
 *============================================================================*/

typedef struct {
    int16_t x, y;
    int16_t dx, dy;
    int16_t prev_x, prev_y;
    uint8_t size;
} Ball_t;

typedef struct {
    int16_t y;
    int16_t prev_y;
    int16_t score;
    InputType_t input;
    int16_t target_y;
} Paddle_t;

typedef struct {
    uint8_t is_running;
    uint8_t is_paused;
    uint8_t winner;
    uint8_t winning_score;
    uint16_t frame_count;
    uint16_t rally_frames;
    uint8_t speed_level;
} GameState_t;

typedef struct {
    uint8_t selectedIndex;
    uint8_t maxItems;
} MenuState_t;

/*============================================================================
 * STRUCTURA PENTRU TIMERE UI DEBUG
 *============================================================================*/

typedef struct {
    uint32_t last_ball_draw_time;
    uint32_t last_paddle_draw_time;
    uint32_t last_score_draw_time;
    uint32_t last_field_draw_time;
    uint32_t last_menu_draw_time;
    uint32_t last_game_update_time;
    uint32_t ball_draw_count;
    uint32_t paddle_draw_count;
    uint32_t frame_count;
    uint32_t last_fps_print;
} UITimers_t;

static UITimers_t g_ui_timers = {0};

/*============================================================================
 * VARIABILE GLOBALE
 *============================================================================*/

InputType_t g_player1_input = INPUT_JOYSTICK;
InputType_t g_player2_input = INPUT_REMOTE;

Screen_t g_currentScreen = SCREEN_INTRO;
MenuState_t g_menuState = {0, 3};

volatile uint8_t g_needsRedraw = 1;

static Ball_t ball;
static Paddle_t paddle1, paddle2;
static GameState_t game;

static int8_t g_p1_move = 0;
static int8_t g_p2_move = 0;



/*============================================================================
 * CONSTANTE PENTRU JOC
 *============================================================================*/

#define FIELD_WIDTH      160
#define FIELD_HEIGHT     128
#define PADDLE_WIDTH     4
#define PADDLE_HEIGHT    22
#define PADDLE_X_P1      4
#define PADDLE_X_P2      152
#define BALL_SIZE        4
#define BALL_START_X     80
#define BALL_START_Y     64
#define PADDLE_START_Y   53
#define SCORE_TO_WIN     5
#define SCORE_Y          2

#define PADDLE_SPEED     4
#define BALL_SPEED_X     1
#define BALL_SPEED_Y     1

#define SPEED_UP_INTERVAL   500
#define MAX_SPEED_LEVEL     5

#define PADDLE_MIN_Y     2
#define PADDLE_MAX_Y     (FIELD_HEIGHT - PADDLE_HEIGHT - 2)

/*============================================================================
 * CONFIGURARE JOYSTICK (ADC)
 *============================================================================*/

#define JOYSTICK_VRX_CHANNEL 8U
#define JOYSTICK_VRY_CHANNEL 9U

#define JOYSTICK_SW_PIN      4U
#define JOYSTICK_SW_PORT     PORTD
#define JOYSTICK_SW_GPIO     GPIOD
#define JOYSTICK_SW_IRQ      PORTD_IRQn

static volatile bool g_joy_btn_pressed = false;
static int16_t g_joy_y_percent = 0;
static bool g_joy_action_consumed = false;

/*============================================================================
 * CONFIGURARE LED-URI ARCADE (2 LED-uri externe)
 *============================================================================*/

// LED Player 1 - PTE20 (LED extern CYAN/ALBASTRU)
#define LED_P1_GPIO      GPIOE
#define LED_P1_PORT      PORTE
#define LED_P1_PIN       20U

// LED Player 2 - PTE21 (LED extern ROSU/MAGENTA)
#define LED_P2_GPIO      GPIOE
#define LED_P2_PORT      PORTE
#define LED_P2_PIN       21U

// Macro-uri control LED (Active LOW - LED conectat intre pin si VCC prin rezistor)
#define LED_P1_ON()      GPIO_ClearPinsOutput(LED_P1_GPIO, 1U << LED_P1_PIN)
#define LED_P1_OFF()     GPIO_SetPinsOutput(LED_P1_GPIO, 1U << LED_P1_PIN)
#define LED_P1_TOGGLE()  GPIO_TogglePinsOutput(LED_P1_GPIO, 1U << LED_P1_PIN)

#define LED_P2_ON()      GPIO_ClearPinsOutput(LED_P2_GPIO, 1U << LED_P2_PIN)
#define LED_P2_OFF()     GPIO_SetPinsOutput(LED_P2_GPIO, 1U << LED_P2_PIN)
#define LED_P2_TOGGLE()  GPIO_TogglePinsOutput(LED_P2_GPIO, 1U << LED_P2_PIN)

// Macro-uri pentru ambele LED-uri
#define LEDS_BOTH_ON()   do { LED_P1_ON(); LED_P2_ON(); } while(0)
#define LEDS_BOTH_OFF()  do { LED_P1_OFF(); LED_P2_OFF(); } while(0)

/*============================================================================
 * CONFIGURARE BUZZER PIEZO (TPM2_CH0 pe PTB2)
 *============================================================================*/

#define BUZZER_PORT      PORTB
#define BUZZER_PIN       2U
#define BUZZER_TPM       TPM2
#define BUZZER_CHANNEL   0U

// Frecvente note muzicale (Hz) - pentru melodia "The Metro" in B minor
// Frecvente note muzicale (Hz) - TEST frecvente joase
#define NOTE_B2   150   // Foarte grav
#define NOTE_C3   160
#define NOTE_D3   170
#define NOTE_E2   130
#define NOTE_FS2  140
#define NOTE_G2   145
#define NOTE_A2   155
#define NOTE_B3   180
#define NOTE_REST 0

// Variabila globala pentru starea sunetului
static volatile uint8_t g_sound_enabled = 1;

/*============================================================================
 * CONFIGURARE IR REMOTE
 *============================================================================*/

#define IR_PIN 12u
#define IR_GPIO GPIOA
#define IR_PORT PORTA
#define IR_IRQ  PORTA_IRQn

