TanaseDoru/FRDM_Pong/TestProjects/MKL25Z4_Display_My_test/source/MKL25Z4_Display_My_test.c
    // Configureaza PTB2 ca TPM2_CH0 (ALT3)
    PORT_SetPinMux(BUZZER_PORT, BUZZER_PIN, kPORT_MuxAlt3);

    // Configureaza sursa clock pentru TPM2
    CLOCK_SetTpmClock(1U);  // MCGFLLCLK sau MCGPLLCLK/2

    // Reset TPM2
    BUZZER_TPM->SC = 0;
    BUZZER_TPM->CNT = 0;
    BUZZER_TPM->MOD = 0xFFFF;

    // Configureaza canalul 0 pentru PWM edge-aligned, high-true
    BUZZER_TPM->CONTROLS[BUZZER_CHANNEL].CnSC = TPM_CnSC_MSB_MASK | TPM_CnSC_ELSB_MASK;
    BUZZER_TPM->CONTROLS[BUZZER_CHANNEL].CnV = 0;  // Duty cycle 0 (off)

    // Porneste TPM2 cu prescaler 1 (48MHz / 1 = 48MHz)
    BUZZER_TPM->SC = TPM_SC_CMOD(1) | TPM_SC_PS(0);

    PRINTF("Buzzer initialized (PTB2, TPM2_CH0)\r\n");
}

void Buzzer_Tone(uint16_t frequency, uint16_t duration_ms) {
    if (!g_sound_enabled || frequency == 0) {
        // Pauza sau sunet dezactivat
        BUZZER_TPM->CONTROLS[BUZZER_CHANNEL].CnV = 0;
        if (duration_ms > 0) {
            delay_ms(duration_ms);
        }
        return;
    }

    // Calculeaza MOD pentru frecventa dorita
    // Clock TPM = 48MHz, frecventa = 48MHz / (MOD + 1)
    // MOD = (48MHz / frecventa) - 1
    uint32_t mod_value = (48000000U / frequency) - 1;
    if (mod_value > 0xFFFF) mod_value = 0xFFFF;

    BUZZER_TPM->CNT = 0;
    BUZZER_TPM->MOD = mod_value;

    // Duty cycle 50% pentru sunet puternic
    BUZZER_TPM->CONTROLS[BUZZER_CHANNEL].CnV = mod_value / 2;

    if (duration_ms > 0) {
        delay_ms(duration_ms);
        // Opreste sunetul dupa durata
        BUZZER_TPM->CONTROLS[BUZZER_CHANNEL].CnV = 0;
    }
}

void Buzzer_Off(void) {
    BUZZER_TPM->CONTROLS[BUZZER_CHANNEL].CnV = 0;
}

void Buzzer_SetEnabled(uint8_t enabled) {
    g_sound_enabled = enabled;
    if (!enabled) {
        Buzzer_Off();
    }
}


// Efect sonor pentru gol
void Buzzer_GoalSound(void) {
    if (!g_sound_enabled) return;

    // Sunet ascendent de celebrare
    Buzzer_Tone(330, 80);   // E4
    Buzzer_Tone(392, 80);   // G4
    Buzzer_Tone(523, 80);   // C5
    Buzzer_Tone(659, 150);  // E5
    Buzzer_Off();
}

// Efect sonor pentru start joc
void Buzzer_StartSound(void) {
    if (!g_sound_enabled) return;

    Buzzer_Tone(440, 150);  // A4
    delay_ms(50);
    Buzzer_Tone(880, 200);  // A5
    Buzzer_Off();
}

// Efect sonor pentru game over
void Buzzer_GameOverSound(void) {
    if (!g_sound_enabled) return;

    Buzzer_Tone(392, 200);  // G4
    Buzzer_Tone(330, 200);  // E4
    Buzzer_Tone(262, 400);  // C4
    Buzzer_Off();
}

/*============================================================================
 * FUNCTII HELPER
 *============================================================================*/

const char* GetInputName(InputType_t input) {
    switch (input) {
        case INPUT_JOYSTICK:  return "Joystick";
        case INPUT_REMOTE:    return "Remote";
        case INPUT_GYROSCOPE: return "Gyro";
        case INPUT_CPU_EASY:  return "CPU Easy";
        case INPUT_CPU_MEDIUM: return "CPU Med";
        case INPUT_CPU_HARD:  return "CPU Hard";
        default:              return "None";
    }
}

bool IsCPUInput(InputType_t input) {
    return (input == INPUT_CPU_EASY || input == INPUT_CPU_MEDIUM || input == INPUT_CPU_HARD);
}

bool IsInputAvailable(InputType_t input, uint8_t forPlayer) {
    if (input == INPUT_NONE) return true;
    if (IsCPUInput(input)) return true;

    if (forPlayer == 1) {
        if (g_player2_input == input) return false;
    } else {
        if (g_player1_input == input) return false;
    }
    return true;
}

void UI_PrintStats(void) {
    uint32_t now = Timer_GetMs();
    if ((now - g_ui_timers.last_fps_print) >= 5000) {
        g_ui_timers.last_fps_print = now;

        if (g_currentScreen == SCREEN_GAMEPLAY) {
            float fps = (float)g_ui_timers.frame_count / 5.0f;
            PRINTF("[UI STATS] FPS: %f | Ball draws: %d | Paddle draws: %d\r\n",
                   fps, g_ui_timers.ball_draw_count, g_ui_timers.paddle_draw_count);
            PRINTF("[UI TIMERS] Ball: %d ms | Paddle: %d ms | Update: %d ms\r\n",
                   g_ui_timers.last_ball_draw_time, g_ui_timers.last_paddle_draw_time,
                   g_ui_timers.last_game_update_time);
        }

        g_ui_timers.frame_count = 0;
        g_ui_timers.ball_draw_count = 0;
        g_ui_timers.paddle_draw_count = 0;
    }
}

/*============================================================================
 * FUNCTII JOYSTICK
 *============================================================================*/

void PORTD_IRQHandler(void) {
    uint32_t isfr = PORT_GetPinsInterruptFlags(JOYSTICK_SW_PORT);
    if (isfr & (1U << JOYSTICK_SW_PIN)) {
        PORT_ClearPinsInterruptFlags(JOYSTICK_SW_PORT, 1U << JOYSTICK_SW_PIN);
        g_joy_btn_pressed = true;
    }
}

static uint16_t Joystick_ReadADC(uint32_t channel) {
    adc16_channel_config_t chConfig = {
        .channelNumber = channel,
        .enableInterruptOnConversionCompleted = false,
        .enableDifferentialConversion = false
    };
    ADC16_SetChannelConfig(ADC0, 0, &chConfig);
    while (0U == (kADC16_ChannelConversionDoneFlag & ADC16_GetChannelStatusFlags(ADC0, 0)));
    return ADC16_GetChannelConversionValue(ADC0, 0);
}

void Joystick_Init(void) {
    adc16_config_t adcConfig;

    CLOCK_EnableClock(kCLOCK_Adc0);
    CLOCK_EnableClock(kCLOCK_PortB);
    CLOCK_EnableClock(kCLOCK_PortD);

    ADC16_GetDefaultConfig(&adcConfig);
    adcConfig.resolution = kADC16_ResolutionSE12Bit;
    ADC16_Init(ADC0, &adcConfig);
    ADC16_DoAutoCalibration(ADC0);

    PORT_SetPinMux(JOYSTICK_SW_PORT, JOYSTICK_SW_PIN, kPORT_MuxAsGpio);
    JOYSTICK_SW_PORT->PCR[JOYSTICK_SW_PIN] |= PORT_PCR_PE_MASK | PORT_PCR_PS_MASK;

    gpio_pin_config_t sw_config = {kGPIO_DigitalInput, 0};
    GPIO_PinInit(JOYSTICK_SW_GPIO, JOYSTICK_SW_PIN, &sw_config);

    PORT_SetPinInterruptConfig(JOYSTICK_SW_PORT, JOYSTICK_SW_PIN, kPORT_InterruptFallingEdge);

    NVIC_SetPriority(JOYSTICK_SW_IRQ, 3);
    EnableIRQ(JOYSTICK_SW_IRQ);

    PRINTF("Joystick initialized (VRY=PTB1, SW=PTD4)\r\n");
}

void Joystick_Process(void) {
    uint16_t y_raw = Joystick_ReadADC(JOYSTICK_VRY_CHANNEL);
    g_joy_y_percent = ((int32_t)y_raw - 2048) * 100 / 2048;

    if (g_joy_y_percent > -20 && g_joy_y_percent < 20) {
        g_joy_action_consumed = false;
    }
}

