TanaseDoru/FRDM_Pong/TestProjects/MKL25Z4_Display_My_test/source/MKL25Z4_Display_My_test.c
typedef enum {
    JOY_ACTION_NONE = 0,
    JOY_ACTION_UP,
    JOY_ACTION_DOWN,
    JOY_ACTION_SELECT
} JoyAction_t;

JoyAction_t Joystick_GetMenuAction(void) {
    if (g_joy_btn_pressed) {
        g_joy_btn_pressed = false;
        return JOY_ACTION_SELECT;
    }

    if (!g_joy_action_consumed) {
        if (g_joy_y_percent > 50) {
            g_joy_action_consumed = true;
            return JOY_ACTION_DOWN;
        }
        if (g_joy_y_percent < -50) {
            g_joy_action_consumed = true;
            return JOY_ACTION_UP;
        }
    }
    return JOY_ACTION_NONE;
}

int16_t Joystick_GetY_Percent(void) {
    return g_joy_y_percent;
}

/*============================================================================
 * FUNCTII IR REMOTE
 *============================================================================*/

void TPM0_IRQHandler(void) {
    if (TPM0->SC & TPM_SC_TOF_MASK) {
        TPM0->SC |= TPM_SC_TOF_MASK;

        if (pulse_count >= 66) {
            capture_complete = 1;
            ir_ready = 1;
        } else if (pulse_count >= 2 && pulse_count <= 4) {
            capture_complete = 1;
            ir_ready = 1;
        } else {
            pulse_count = 0;
            capture_complete = 0;
        }
    }
}

void PORTA_IRQHandler(void) {
    uint32_t isfr = PORT_GetPinsInterruptFlags(IR_PORT);

    if (isfr & (1U << IR_PIN)) {
        PORT_ClearPinsInterruptFlags(IR_PORT, 1U << IR_PIN);

        if (!capture_complete) {
            uint32_t current_val = TPM0->CNT;
            TPM0->CNT = 0;

            if (current_val > GLITCH_THRESHOLD) {
                if (pulse_count < 100) {
                    pulse_buffer[pulse_count++] = current_val;
                }
            }
        }
    }
}

void IR_DecodeNEC(void) {
    ir_code = 0;

    if (pulse_count >= 2 && pulse_count <= 4) {
        if (pulse_buffer[0] > 12000 && pulse_buffer[0] < 15000) {
            if (pulse_count >= 2 && pulse_buffer[1] > 2000 && pulse_buffer[1] < 4500) {
                ir_code = last_ir_code;
                return;
            }
        }
    }

    int start_index = -1;
    if (pulse_buffer[0] > 12000 && pulse_buffer[0] < 15000) start_index = 0;
    else if (pulse_count > 1 && pulse_buffer[1] > 12000 && pulse_buffer[1] < 15000) start_index = 1;

    if (start_index == -1) return;

    uint32_t hdr_space = pulse_buffer[start_index + 1];

    if (hdr_space < 4000) {
        ir_code = last_ir_code;
        return;
    }

    for (int i = 0; i < 32; i++) {
        int idx = start_index + 3 + (i * 2);
        if (idx >= (int)pulse_count) break;

        uint32_t space_duration = pulse_buffer[idx];
        if (space_duration > 1600) {
            ir_code |= (1UL << i);
        }
    }

    if (ir_code != 0) {
        last_ir_code = ir_code;
    }
}

void IR_Init(void) {
    CLOCK_EnableClock(kCLOCK_PortA);
    PORT_SetPinMux(IR_PORT, IR_PIN, kPORT_MuxAsGpio);

    IR_PORT->PCR[IR_PIN] |= PORT_PCR_PE_MASK | PORT_PCR_PS_MASK;

    gpio_pin_config_t gpioPinConfig = { kGPIO_DigitalInput, 0 };
    GPIO_PinInit(IR_GPIO, IR_PIN, &gpioPinConfig);

    PORT_SetPinInterruptConfig(IR_PORT, IR_PIN, kPORT_InterruptEitherEdge);

    NVIC_SetPriority(IR_IRQ, 2);
    EnableIRQ(IR_IRQ);

    PRINTF("IR Remote initialized (Pin=PTA12)\r\n");
}

void TPM0_Init(void) {
    CLOCK_EnableClock(kCLOCK_Tpm0);
    CLOCK_SetTpmClock(1U);

    TPM0->SC = 0;
    TPM0->CNT = 0;
    TPM0->MOD = 0xFFFF;

    TPM0->SC = TPM_SC_PS(5) | TPM_SC_TOIE_MASK | TPM_SC_CMOD(1);

    NVIC_SetPriority(TPM0_IRQn, 3);
    EnableIRQ(TPM0_IRQn);
}

JoyAction_t IR_GetMenuAction(void) {
    if (!ir_ready) return JOY_ACTION_NONE;

    uint32_t now = Timer_GetMs();
    if ((now - last_ir_time) < IR_DEBOUNCE_MS) {
        ir_ready = 0;
        capture_complete = 0;
        pulse_count = 0;
        return JOY_ACTION_NONE;
    }

    IR_DecodeNEC();

    JoyAction_t action = JOY_ACTION_NONE;

    if (ir_code != 0) {
        last_ir_time = now;

        switch (ir_code) {
            case IR_KEY_UP:    action = JOY_ACTION_UP; break;
            case IR_KEY_DOWN:  action = JOY_ACTION_DOWN; break;
            case IR_KEY_OK:    action = JOY_ACTION_SELECT; break;
            default: break;
        }

        PRINTF("[IR MENU] Code: 0x%08X -> Action: %d\r\n", ir_code, action);
    }

    ir_ready = 0;
    capture_complete = 0;
    pulse_count = 0;

    return action;
}

/* === NOU: Proceseaza IR pentru gameplay === */
void IR_ProcessGameInput(void) {
    uint32_t now = Timer_GetMs();

    /* Timeout - opreste miscarea daca nu vine semnal */
    if ((now - g_ir_last_input_time) > IR_INPUT_TIMEOUT_MS) {
        g_ir_current_direction = 0;
    }

    if (!ir_ready) return;

    if ((now - last_ir_time) < IR_GAME_DEBOUNCE_MS) {
        ir_ready = 0;
        capture_complete = 0;
        pulse_count = 0;
        return;
    }

    IR_DecodeNEC();

    if (ir_code != 0) {
        last_ir_time = now;
        g_ir_last_input_time = now;

        switch (ir_code) {
            case IR_KEY_UP:
                g_ir_current_direction = -1;
                PRINTF("[IR GAME] UP\r\n");
                break;
            case IR_KEY_DOWN:
                g_ir_current_direction = 1;
                PRINTF("[IR GAME] DOWN\r\n");
                break;
            case IR_KEY_OK:
            case IR_KEY_POWER:
                break;
            default:
                g_ir_current_direction = 0;
                break;
        }
    }

    ir_ready = 0;
    capture_complete = 0;
    pulse_count = 0;
}

int8_t IR_GetCurrentDirection(void) {
    return g_ir_current_direction;
}

void IR_ResetGameState(void) {
    g_ir_current_direction = 0;
    g_ir_last_input_time = 0;
    ir_ready = 0;
    capture_complete = 0;
    pulse_count = 0;
}

bool IR_CheckPauseOnly(void) {
    if (!ir_ready) return false;

    uint32_t now = Timer_GetMs();
    if ((now - last_ir_time) < IR_DEBOUNCE_MS) return false;

    IR_DecodeNEC();

    if (ir_code == IR_KEY_OK || ir_code == IR_KEY_POWER) {
        last_ir_time = now;
        ir_ready = 0;
        capture_complete = 0;
        pulse_count = 0;
        PRINTF("[IR] Pause detected\r\n");
        return true;
    }

