TanaseDoru/FRDM_Pong/TestProjects/MKL25Z4_Display_My_test/source/MKL25Z4_Display_My_test.c
    return false;
}

bool IR_IsPausePressed(void) {
    if (!ir_ready) return false;

    uint32_t now = Timer_GetMs();
    if ((now - last_ir_time) < IR_DEBOUNCE_MS) {
        ir_ready = 0;
        capture_complete = 0;
        pulse_count = 0;
        return false;
    }

    IR_DecodeNEC();

    bool pause_pressed = false;

    if (ir_code == IR_KEY_OK || ir_code == IR_KEY_POWER) {
        pause_pressed = true;
        last_ir_time = now;
    }

    ir_ready = 0;
    capture_complete = 0;
    pulse_count = 0;

    return pause_pressed;
}
/*============================================================================
 * FUNCTII GYROSCOPE / ESP (UART1)
 *============================================================================*/

#define GYRO_UART UART1
#define GYRO_UART_CLKSRC kCLOCK_BusClk
#define GYRO_BAUD_RATE 115200
#define GYRO_BUFFER_SIZE 64

static char g_gyro_rx_buffer[GYRO_BUFFER_SIZE];
static uint8_t g_gyro_rx_index = 0;

static float  g_gyro_angle = 0.0f;
static int16_t g_gyro_paddle_y = PADDLE_START_Y;
static uint32_t g_last_gyro_update = 0;

void Gyro_Init(void) {
    uart_config_t config;

    CLOCK_EnableClock(kCLOCK_PortE);
    CLOCK_EnableClock(kCLOCK_Uart1);

    PORT_SetPinMux(PORTE, 0U, kPORT_MuxAlt3); // PTE0 = TX
    PORT_SetPinMux(PORTE, 1U, kPORT_MuxAlt3); // PTE1 = RX

    UART_GetDefaultConfig(&config);
    config.baudRate_Bps = GYRO_BAUD_RATE;
    config.enableTx = true;
    config.enableRx = true;

    UART_Init(GYRO_UART, &config, CLOCK_GetFreq(GYRO_UART_CLKSRC));

    UART_DisableInterrupts(GYRO_UART,
        kUART_RxDataRegFullInterruptEnable | kUART_RxOverrunInterruptEnable);

    PRINTF("Gyroscope/ESP initialized (UART1, PTE0/PTE1)\r\n");
}

// ==> versiune aproape identica cu Check_UART_Data din codul care merge
int Gyro_Check_UART_Data(void) {
    uint32_t flags = UART_GetStatusFlags(GYRO_UART);

    if (flags & (kUART_RxOverrunFlag | kUART_NoiseErrorFlag | kUART_FramingErrorFlag)) {
        UART_ClearStatusFlags(GYRO_UART,
                              kUART_RxOverrunFlag | kUART_NoiseErrorFlag | kUART_FramingErrorFlag);
        g_gyro_rx_index = 0;
        return 0;
    }

    if (flags & kUART_RxDataRegFullFlag) {
        uint8_t data = UART_ReadByte(GYRO_UART);

        if (data == '\n' || data == '\r') {
            if (g_gyro_rx_index > 0) {
                g_gyro_rx_buffer[g_gyro_rx_index] = 0;
                g_gyro_rx_index = 0;
                return 1;    // avem linie completă
            }
        } else {
            if (g_gyro_rx_index < GYRO_BUFFER_SIZE - 1) {
                g_gyro_rx_buffer[g_gyro_rx_index++] = data;
            }
        }
    }
    return 0;
}

// mapping adaptat la PADDLE_MIN_Y / MAX_Y din joc
int16_t Map_Angle_To_Paddle(float angle) {
    if (angle > 45.0f) angle = 45.0f;
    if (angle < -45.0f) angle = -45.0f;

    // -45 -> jos, +45 -> sus
    float normalized = (angle + 45.0f) / 90.0f;   // [0..1]
    int16_t y = PADDLE_MAX_Y - (int16_t)(normalized * (PADDLE_MAX_Y - PADDLE_MIN_Y));

    if (y < PADDLE_MIN_Y) y = PADDLE_MIN_Y;
    if (y > PADDLE_MAX_Y) y = PADDLE_MAX_Y;
    return y;
}

// directia busolei, ca in codul tau
const char* Gyro_GetCompassDir(float heading) {
    if (heading >= 337.5 || heading < 22.5)  return "NORD";
    if (heading >= 22.5  && heading < 67.5)  return "N-EST";
    if (heading >= 67.5  && heading < 112.5) return "EST";
    if (heading >= 112.5 && heading < 157.5) return "S-EST";
    if (heading >= 157.5 && heading < 202.5) return "SUD";
    if (heading >= 202.5 && heading < 247.5) return "S-VEST";
    if (heading >= 247.5 && heading < 292.5) return "VEST";
    if (heading >= 292.5 && heading < 337.5) return "N-VEST";
    return "???";
}

// === EXACT ca Process_Data din codul mic, doar ca scriem in g_gyro_paddle_y
void Gyro_Process_Data(char* input) {
    int ang = 0;
    int head = 0;

    char* p1 = strchr(input, ',');
    if (p1) {
        *p1 = 0;
        ang = atoi(input);

        char* p2 = strchr(p1 + 1, ',');
        if (p2) {
            *p2 = 0;
            head = atoi(p2 + 1);
        }
    }

    g_gyro_angle = (float)ang;
    float compassHeading = (float)head;
    g_gyro_paddle_y = Map_Angle_To_Paddle(g_gyro_angle);
    g_last_gyro_update = Timer_GetMs();

    char directionStr[20];
    if (ang > 3) {
        strcpy(directionStr, "SUS (Dreapta)");
    } else if (ang < -3) {
        strcpy(directionStr, "JOS (Stanga)");
    } else {
        strcpy(directionStr, "CENTRU");
    }

    char semn = (ang >= 0) ? '+' : '-';
    const char* compassDir = Gyro_GetCompassDir(compassHeading);

    PRINTF("Inclinatie: %c%d [%s] | Y: %d | Busola: %d (%s)\r\n",
           semn,
           abs(ang),
           directionStr,
           g_gyro_paddle_y,
           head,
           compassDir);
}

int16_t Gyro_GetPaddleY(void) {
    return g_gyro_paddle_y;
}

bool Gyro_IsActive(void) {
    return (Timer_GetMs() - g_last_gyro_update) < 500;
}


/*============================================================================
 * FUNCTII AI / BOT
 *============================================================================*/

int16_t AI_PredictBallY(int16_t target_x) {
    int16_t sim_x = ball.x;
    int16_t sim_y = ball.y;
    int16_t sim_dx = ball.dx;
    int16_t sim_dy = ball.dy;

    int iterations = 0;
    while (iterations < 200) {
        sim_x += sim_dx;
        sim_y += sim_dy;

        if (sim_y <= 2 || sim_y >= FIELD_HEIGHT - BALL_SIZE - 2) {
            sim_dy = -sim_dy;
            if (sim_y <= 2) sim_y = 3;
            if (sim_y >= FIELD_HEIGHT - BALL_SIZE - 2) sim_y = FIELD_HEIGHT - BALL_SIZE - 3;
        }

        if ((sim_dx > 0 && sim_x >= target_x) || (sim_dx < 0 && sim_x <= target_x)) {
            return sim_y;
        }

        iterations++;
    }

    return FIELD_HEIGHT / 2;
}

void AI_UpdatePaddle(Paddle_t* paddle, bool is_right_side) {
    int16_t paddle_center = paddle->y + PADDLE_HEIGHT / 2;
    int16_t target_y;
    int16_t speed;
    int16_t reaction_zone;
    int16_t error_margin;
    int16_t mistake_chance;
    int16_t update_interval;

    switch (paddle->input) {
        case INPUT_CPU_EASY:
            speed = 1; reaction_zone = 35; error_margin = 35;
            mistake_chance = 35; update_interval = 20;
            break;
        case INPUT_CPU_MEDIUM:
            speed = 2; reaction_zone = 80; error_margin = 15;
            mistake_chance = 12; update_interval = 10;
            break;
        case INPUT_CPU_HARD:
            speed = 4; reaction_zone = 160; error_margin = 5;
            mistake_chance = 0; update_interval = 3;
            break;
        default:
            return;
    }

