TanaseDoru/FRDM_Pong/TestProjects/MKL25Z4_Display_My_test/source/MKL25Z4_Display_My_test.c
    bool ball_coming = (is_right_side && ball.dx > 0) || (!is_right_side && ball.dx < 0);

    if (ball_coming) {
        if (game.frame_count % update_interval == 0) {
            int16_t target_x = is_right_side ? PADDLE_X_P2 : PADDLE_X_P1 + PADDLE_WIDTH;
            paddle->target_y = AI_PredictBallY(target_x);

            if (error_margin > 0) {
                paddle->target_y += (rand() % (error_margin * 2)) - error_margin;
            }
        }
        target_y = paddle->target_y;
    } else {
        target_y = FIELD_HEIGHT / 2;
        speed = 1;
    }

    int16_t ball_dist = is_right_side ? (PADDLE_X_P2 - ball.x) : (ball.x - PADDLE_X_P1);

    if (ball_dist < reaction_zone || !ball_coming) {
        bool make_mistake = (mistake_chance > 0) && ((rand() % 100) < mistake_chance);

        if (make_mistake) {
            int mistake_type = rand() % 3;
            if (mistake_type == 0) paddle->y -= speed;
            else if (mistake_type == 1) paddle->y += speed;
        } else {
            if (paddle_center < target_y - 5) paddle->y += speed;
            else if (paddle_center > target_y + 5) paddle->y -= speed;
        }
    }

    if (paddle->y < PADDLE_MIN_Y) paddle->y = PADDLE_MIN_Y;
    if (paddle->y > PADDLE_MAX_Y) paddle->y = PADDLE_MAX_Y;
}

/*============================================================================
 * FUNCTII JOC PONG
 *============================================================================*/

void Game_Init(void) {
    ball.x = BALL_START_X;
    ball.y = BALL_START_Y;
    ball.dx = BALL_SPEED_X;
    ball.dy = BALL_SPEED_Y;
    ball.prev_x = ball.x;
    ball.prev_y = ball.y;
    ball.size = BALL_SIZE;

    if (rand() % 2) ball.dx = -ball.dx;
    if (rand() % 2) ball.dy = -ball.dy;

    paddle1.y = PADDLE_START_Y;
    paddle1.prev_y = paddle1.y;
    paddle1.score = 0;
    paddle1.input = g_player1_input;
    paddle1.target_y = FIELD_HEIGHT / 2;

    paddle2.y = PADDLE_START_Y;
    paddle2.prev_y = paddle2.y;
    paddle2.score = 0;
    paddle2.input = g_player2_input;
    paddle2.target_y = FIELD_HEIGHT / 2;

    game.is_running = 1;
    game.is_paused = 0;
    game.winner = 0;
    game.winning_score = SCORE_TO_WIN;
    game.frame_count = 0;
    game.rally_frames = 0;
    game.speed_level = 0;

    g_p1_move = 0;
    g_p2_move = 0;

    IR_ResetGameState();

    // ADAUGĂ ACEASTA SECȚIUNE:
    // Inițializează giroscopul la poziția de start
    if (g_player1_input == INPUT_GYROSCOPE || g_player2_input == INPUT_GYROSCOPE) {
        g_gyro_paddle_y = PADDLE_START_Y;
        g_gyro_angle = 0.0f;
        g_last_gyro_update = Timer_GetMs();
    }

    memset(&g_ui_timers, 0, sizeof(g_ui_timers));
    g_ui_timers.last_fps_print = Timer_GetMs();
}
void Game_DrawField(void) {
    uint32_t start = Timer_GetMs();

    ST7735_FillScreen(COLOR_BLACK);

    for (int16_t y = 4; y < FIELD_HEIGHT - 4; y += 8) {
        ST7735_FillRect(79, y, 2, 4, COLOR_DARK_GRAY);
    }

    ST7735_DrawHLine(0, 0, FIELD_WIDTH, COLOR_WHITE);
    ST7735_DrawHLine(0, FIELD_HEIGHT - 1, FIELD_WIDTH, COLOR_WHITE);

    g_ui_timers.last_field_draw_time = Timer_GetMs() - start;
}

void Game_DrawScore(void) {
    uint32_t start = Timer_GetMs();
    char buf[8];

    ST7735_FillRect(55, SCORE_Y, 50, 10, COLOR_BLACK);

    snprintf(buf, sizeof(buf), "%d", paddle1.score);
    ST7735_DrawStringScaled(68, SCORE_Y, buf, COLOR_CYAN, COLOR_BLACK, 1);

    ST7735_DrawString(77, SCORE_Y, "-", COLOR_WHITE, COLOR_BLACK);

    snprintf(buf, sizeof(buf), "%d", paddle2.score);
    ST7735_DrawStringScaled(86, SCORE_Y, buf, COLOR_MAGENTA, COLOR_BLACK, 1);

    g_ui_timers.last_score_draw_time = Timer_GetMs() - start;
}

void Game_DrawPaddle(Paddle_t* paddle, int16_t x, uint16_t color) {
    uint32_t start = Timer_GetMs();

    if (paddle->y != paddle->prev_y) {
        int16_t diff = abs(paddle->y - paddle->prev_y);

        // Dacă diferența e prea mare (salt brusc de la giroscop), șterge tot
        if (diff > PADDLE_HEIGHT) {
            ST7735_FillRect(x, paddle->prev_y, PADDLE_WIDTH, PADDLE_HEIGHT, COLOR_BLACK);
        } else {
            // Mișcare normală - șterge doar diferența
            if (paddle->y > paddle->prev_y) {
                int16_t clear_h = paddle->y - paddle->prev_y;
                if (clear_h > PADDLE_HEIGHT) clear_h = PADDLE_HEIGHT;
                ST7735_FillRect(x, paddle->prev_y, PADDLE_WIDTH, clear_h, COLOR_BLACK);
            } else {
                int16_t clear_h = paddle->prev_y - paddle->y;
                if (clear_h > PADDLE_HEIGHT) clear_h = PADDLE_HEIGHT;
                ST7735_FillRect(x, paddle->y + PADDLE_HEIGHT, PADDLE_WIDTH, clear_h, COLOR_BLACK);
            }
        }
    }

    ST7735_FillRect(x, paddle->y, PADDLE_WIDTH, PADDLE_HEIGHT, color);

    paddle->prev_y = paddle->y;

    g_ui_timers.last_paddle_draw_time = Timer_GetMs() - start;
    g_ui_timers.paddle_draw_count++;
}

void Game_RedrawCenterLine(void) {
    for (int16_t y = 4; y < FIELD_HEIGHT - 4; y += 8) {
        ST7735_FillRect(79, y, 2, 4, COLOR_DARK_GRAY);
    }
}

void Game_DrawBall(void) {
    uint32_t start = Timer_GetMs();

    if (ball.x != ball.prev_x || ball.y != ball.prev_y) {
        ST7735_FillRect(ball.prev_x, ball.prev_y, ball.size, ball.size, COLOR_BLACK);
    }

    ST7735_FillRect(ball.x, ball.y, ball.size, ball.size, COLOR_YELLOW);

    if ((ball.x >= 70 && ball.x <= 90) || (ball.prev_x >= 70 && ball.prev_x <= 90)) {
        Game_RedrawCenterLine();
    }

    if (ball.y < 15 || ball.prev_y < 15) {
        Game_DrawScore();
    }

    ball.prev_x = ball.x;
    ball.prev_y = ball.y;

    g_ui_timers.last_ball_draw_time = Timer_GetMs() - start;
    g_ui_timers.ball_draw_count++;
}

void Game_ResetBall(void) {
    ST7735_FillRect(ball.prev_x, ball.prev_y, ball.size, ball.size, COLOR_BLACK);

    ball.x = BALL_START_X;
    ball.y = BALL_START_Y;
    ball.prev_x = ball.x;
    ball.prev_y = ball.y;

    int8_t dir = (ball.dx > 0) ? -1 : 1;
    ball.dx = dir * BALL_SPEED_X;
    ball.dy = (rand() % 2) ? BALL_SPEED_Y : -BALL_SPEED_Y;

    game.rally_frames = 0;
    game.speed_level = 0;

    delay_ms(500);
}

void Game_Update(void) {
    uint32_t start = Timer_GetMs();

    if (!game.is_running || game.is_paused) return;

    game.frame_count++;
    game.rally_frames++;
    g_ui_timers.frame_count++;

    /* Accelerare minge */
    if (game.rally_frames > 0 &&
        game.rally_frames % SPEED_UP_INTERVAL == 0 &&
        game.speed_level < MAX_SPEED_LEVEL) {

        game.speed_level++;

        if (ball.dx > 0) ball.dx++;
        else ball.dx--;

