TanaseDoru/FRDM_Pong/TestProjects/MKL25Z4_Display_My_test/source/MKL25Z4_Display_My_test.c
    // 1 - LED P1 flash
    ST7735_FillRect(40, 50, 80, 30, COLOR_DARK_GRAY);
    ST7735_DrawRect(40, 50, 80, 30, COLOR_WHITE);
    ST7735_DrawStringCentered(58, "1", COLOR_WHITE, COLOR_DARK_GRAY, 2);
    LED_P2_OFF();
    LED_P1_ON();
    delay_ms(400);

    // GO! - ambele flash rapid + sunet start
    ST7735_FillRect(40, 50, 80, 30, COLOR_GREEN);
    ST7735_DrawRect(40, 50, 80, 30, COLOR_WHITE);
    ST7735_DrawStringCentered(58, "GO!", COLOR_WHITE, COLOR_GREEN, 2);
    LED_P1_OFF();
    LEDS_BOTH_ON();
    Buzzer_StartSound();  // Sunet start joc
    LEDS_BOTH_OFF();
    delay_ms(200);

    ST7735_FillRect(40, 50, 80, 30, COLOR_BLACK);
    Game_RedrawCenterLine();

    g_currentScreen = SCREEN_GAMEPLAY;
}

/*============================================================================
 * FUNCTII DE DESENARE MENIU
 *============================================================================*/

void DrawTitle(const char* title) {
    ST7735_FillRect(0, 0, ST7735_WIDTH, 30, COLOR_BG);
    ST7735_DrawStringCentered(TITLE_Y, title, COLOR_TITLE, COLOR_BG, 2);
    ST7735_DrawHLine(0, 32, ST7735_WIDTH, COLOR_TITLE);
}

void DrawMenuItem(uint8_t index, const char* text, bool selected, bool enabled) {
    int16_t y = MENU_START_Y + index * MENU_ITEM_HEIGHT;
    uint16_t bgColor = selected ? COLOR_DARK_GRAY : COLOR_BG;
    uint16_t textColor;

    if (!enabled) textColor = COLOR_DISABLED;
    else if (selected) textColor = COLOR_SELECTED;
    else textColor = COLOR_NORMAL;

    ST7735_FillRect(0, y, ST7735_WIDTH, MENU_ITEM_HEIGHT, bgColor);

    if (selected) ST7735_DrawString(MENU_MARGIN_X, y + 3, ">", COLOR_SELECTED, bgColor);
    ST7735_DrawString(MENU_MARGIN_X + 12, y + 3, text, textColor, bgColor);
}

void DrawInputMenuItem(uint8_t index, InputType_t input, bool selected, uint8_t forPlayer) {
    int16_t y = MENU_START_Y + index * MENU_ITEM_HEIGHT;
    bool available = IsInputAvailable(input, forPlayer);
    bool isCurrentSelection;

    if (forPlayer == 1) isCurrentSelection = (g_player1_input == input);
    else isCurrentSelection = (g_player2_input == input);

    uint16_t bgColor = selected ? COLOR_DARK_GRAY : COLOR_BG;
    uint16_t textColor;

    if (!available) textColor = COLOR_DISABLED;
    else if (isCurrentSelection) textColor = COLOR_HIGHLIGHT;
    else if (selected) textColor = COLOR_SELECTED;
    else textColor = COLOR_NORMAL;

    ST7735_FillRect(0, y, ST7735_WIDTH, MENU_ITEM_HEIGHT, bgColor);

    if (selected) ST7735_DrawString(MENU_MARGIN_X, y + 3, ">", COLOR_SELECTED, bgColor);
    ST7735_DrawString(MENU_MARGIN_X + 12, y + 3, GetInputName(input), textColor, bgColor);

    if (isCurrentSelection) {
        ST7735_DrawString(115, y + 3, "<-", COLOR_HIGHLIGHT, bgColor);
    } else if (!available) {
        if (forPlayer == 1) ST7735_DrawString(108, y + 3, "[P2]", COLOR_RED, bgColor);
        else ST7735_DrawString(108, y + 3, "[P1]", COLOR_CYAN, bgColor);
    }
}

void DrawBackOption(uint8_t index, bool selected) {
    int16_t y = MENU_START_Y + index * MENU_ITEM_HEIGHT;
    uint16_t bgColor = selected ? COLOR_DARK_GRAY : COLOR_BG;

    ST7735_FillRect(0, y, ST7735_WIDTH, MENU_ITEM_HEIGHT, bgColor);
    if (selected) ST7735_DrawString(MENU_MARGIN_X, y + 3, ">", COLOR_SELECTED, bgColor);
    ST7735_DrawString(MENU_MARGIN_X + 12, y + 3, "<< Back", COLOR_BACK, bgColor);
}

/*============================================================================
 * FUNCTII PENTRU FIECARE ECRAN
 *============================================================================*/

void DrawMainScreen(void) {
    uint32_t start = Timer_GetMs();

    // Opreste LED-urile cand suntem in meniul principal
    LEDS_BOTH_OFF();

    ST7735_FillScreen(COLOR_BG);
    DrawTitle("PONG GAME");

    DrawMenuItem(0, "Start", g_menuState.selectedIndex == 0, true);
    DrawMenuItem(1, "Select Input", g_menuState.selectedIndex == 1, true);

    ST7735_DrawHLine(0, 100, ST7735_WIDTH, COLOR_GRAY);

    char buf[32];
    snprintf(buf, sizeof(buf), "P1:%s", GetInputName(g_player1_input));
    ST7735_DrawString(5, 108, buf, COLOR_CYAN, COLOR_BG);

    snprintf(buf, sizeof(buf), "P2:%s", GetInputName(g_player2_input));
    ST7735_DrawString(85, 108, buf, COLOR_MAGENTA, COLOR_BG);

    g_ui_timers.last_menu_draw_time = Timer_GetMs() - start;
}

void DrawStartScreen(void) {
    ST7735_FillScreen(COLOR_BG);
    DrawTitle("START");

    DrawMenuItem(0, "Player vs Player", g_menuState.selectedIndex == 0, true);
    DrawMenuItem(1, "Player vs CPU", g_menuState.selectedIndex == 1, true);
    DrawBackOption(2, g_menuState.selectedIndex == 2);
}

void DrawSelectInputScreen(void) {
    // Opreste LED-urile cand ne intoarcem la select input
    LEDS_BOTH_OFF();

    ST7735_FillScreen(COLOR_BG);
    DrawTitle("SELECT INPUT");

    DrawMenuItem(0, "Player 1", g_menuState.selectedIndex == 0, true);
    DrawMenuItem(1, "Player 2", g_menuState.selectedIndex == 1, true);
    DrawBackOption(2, g_menuState.selectedIndex == 2);

    ST7735_DrawHLine(0, 95, ST7735_WIDTH, COLOR_GRAY);
    ST7735_DrawString(5, 100, "Current Setup:", COLOR_GRAY, COLOR_BG);

    char buf[24];
    snprintf(buf, sizeof(buf), "P1: %s", GetInputName(g_player1_input));
    ST7735_DrawString(5, 112, buf, COLOR_CYAN, COLOR_BG);

    snprintf(buf, sizeof(buf), "P2: %s", GetInputName(g_player2_input));
    ST7735_DrawString(85, 112, buf, COLOR_MAGENTA, COLOR_BG);
}

void DrawSelectP1Screen(void) {
    // LED P2 ON cand selectam pentru Player 1 (inversat)
    LED_P1_OFF();
    LED_P2_ON();

    ST7735_FillScreen(COLOR_BG);
    DrawTitle("PLAYER 1");

    DrawInputMenuItem(0, INPUT_JOYSTICK, g_menuState.selectedIndex == 0, 1);
    DrawInputMenuItem(1, INPUT_REMOTE, g_menuState.selectedIndex == 1, 1);
    DrawInputMenuItem(2, INPUT_GYROSCOPE, g_menuState.selectedIndex == 2, 1);
    DrawBackOption(3, g_menuState.selectedIndex == 3);
}

void DrawSelectP2Screen(void) {
    // LED P1 ON cand selectam pentru Player 2 (inversat)
    LED_P2_OFF();
    LED_P1_ON();

    ST7735_FillScreen(COLOR_BG);
    DrawTitle("PLAYER 2");

    DrawInputMenuItem(0, INPUT_JOYSTICK, g_menuState.selectedIndex == 0, 2);
    DrawInputMenuItem(1, INPUT_REMOTE, g_menuState.selectedIndex == 1, 2);
    DrawInputMenuItem(2, INPUT_GYROSCOPE, g_menuState.selectedIndex == 2, 2);
    DrawBackOption(3, g_menuState.selectedIndex == 3);
}

