TanaseDoru/FRDM_Pong/TestProjects/MKL25Z4_Display_My_test/source/MKL25Z4_Display_My_test.c
void DrawDifficultyScreen(void) {
    ST7735_FillScreen(COLOR_BG);
    DrawTitle("DIFFICULTY");

    DrawMenuItem(0, "Easy", g_menuState.selectedIndex == 0, true);
    if (g_menuState.selectedIndex == 0) {
        ST7735_DrawString(90, MENU_START_Y + 3, "(Slow)", COLOR_GRAY, COLOR_DARK_GRAY);
    }

    DrawMenuItem(1, "Medium", g_menuState.selectedIndex == 1, true);
    if (g_menuState.selectedIndex == 1) {
        ST7735_DrawString(90, MENU_START_Y + MENU_ITEM_HEIGHT + 3, "(Normal)", COLOR_GRAY, COLOR_DARK_GRAY);
    }

    DrawMenuItem(2, "Hard", g_menuState.selectedIndex == 2, true);
    if (g_menuState.selectedIndex == 2) {
        ST7735_DrawString(90, MENU_START_Y + 2*MENU_ITEM_HEIGHT + 3, "(Fast)", COLOR_GRAY, COLOR_DARK_GRAY);
    }

    DrawBackOption(3, g_menuState.selectedIndex == 3);

    ST7735_DrawHLine(0, 100, ST7735_WIDTH, COLOR_GRAY);
    ST7735_DrawString(10, 108, "P1: Joystick", COLOR_CYAN, COLOR_BG);
    ST7735_DrawString(90, 108, "P2: CPU", COLOR_MAGENTA, COLOR_BG);
}

void DrawGameOverScreen(void) {
    // === LED CELEBRATION + SUNET la Game Over ===
    Buzzer_GameOverSound();         // Sunet game over
    LED_AlternatingFlash(5, 120);   // Flash alternativ rapid
    LED_VictoryPulse(game.winner);  // Pulsuri pentru castigator

    ST7735_FillScreen(COLOR_BG);

    ST7735_DrawStringCentered(15, "GAME OVER", COLOR_RED, COLOR_BG, 2);

    char buf[32];
    uint16_t winner_color = (game.winner == 1) ? COLOR_CYAN : COLOR_MAGENTA;
    snprintf(buf, sizeof(buf), "Player %d Wins!", game.winner);
    ST7735_DrawStringCentered(45, buf, winner_color, COLOR_BG, 1);

    snprintf(buf, sizeof(buf), "%d - %d", paddle1.score, paddle2.score);
    ST7735_DrawStringCentered(60, buf, COLOR_WHITE, COLOR_BG, 2);

    ST7735_DrawHLine(0, 82, ST7735_WIDTH, COLOR_GRAY);

    uint16_t bg0 = (g_menuState.selectedIndex == 0) ? COLOR_DARK_GRAY : COLOR_BG;
    uint16_t col0 = (g_menuState.selectedIndex == 0) ? COLOR_SELECTED : COLOR_NORMAL;
    ST7735_FillRect(0, 88, ST7735_WIDTH, 16, bg0);
    if (g_menuState.selectedIndex == 0) ST7735_DrawString(MENU_MARGIN_X, 92, ">", COLOR_SELECTED, bg0);
    ST7735_DrawString(MENU_MARGIN_X + 12, 92, "Play Again", col0, bg0);

    uint16_t bg1 = (g_menuState.selectedIndex == 1) ? COLOR_DARK_GRAY : COLOR_BG;
    uint16_t col1 = (g_menuState.selectedIndex == 1) ? COLOR_SELECTED : COLOR_NORMAL;
    ST7735_FillRect(0, 106, ST7735_WIDTH, 16, bg1);
    if (g_menuState.selectedIndex == 1) ST7735_DrawString(MENU_MARGIN_X, 110, ">", COLOR_SELECTED, bg1);
    ST7735_DrawString(MENU_MARGIN_X + 12, 110, "Main Menu", col1, bg1);
}

static uint8_t g_pause_selection = 0;

void DrawPausedScreen(void) {
    ST7735_FillRect(25, 35, 110, 60, COLOR_DARK_GRAY);
    ST7735_DrawRect(25, 35, 110, 60, COLOR_WHITE);
    ST7735_DrawRect(27, 37, 106, 56, COLOR_GRAY);

    ST7735_DrawStringCentered(42, "PAUSED", COLOR_YELLOW, COLOR_DARK_GRAY, 2);

    if (g_pause_selection == 0) {
        ST7735_FillRect(40, 62, 80, 12, COLOR_CYAN);
        ST7735_DrawString(45, 64, "> Resume", COLOR_BLACK, COLOR_CYAN);
    } else {
        ST7735_FillRect(40, 62, 80, 12, COLOR_DARK_GRAY);
        ST7735_DrawString(50, 64, "Resume", COLOR_WHITE, COLOR_DARK_GRAY);
    }

    if (g_pause_selection == 1) {
        ST7735_FillRect(40, 76, 80, 12, COLOR_RED);
        ST7735_DrawString(45, 78, "> Exit", COLOR_WHITE, COLOR_RED);
    } else {
        ST7735_FillRect(40, 76, 80, 12, COLOR_DARK_GRAY);
        ST7735_DrawString(50, 78, "Exit", COLOR_GRAY, COLOR_DARK_GRAY);
    }
}

/*============================================================================
 * ECRAN INTRO ANIMAT
 *============================================================================*/

static const uint16_t rainbow_colors[] = {
    COLOR_RED, COLOR_ORANGE, COLOR_YELLOW, COLOR_GREEN, COLOR_CYAN, COLOR_BLUE, COLOR_MAGENTA
};
#define NUM_RAINBOW_COLORS 7

#define BMO_SCREEN_COLOR  0x0400
#define BMO_FACE_COLOR    COLOR_BLACK

void DrawBMOFace(uint8_t expression, uint8_t blink) {
    ST7735_FillScreen(BMO_SCREEN_COLOR);

    if (blink) {
        ST7735_FillRect(30, 40, 35, 5, BMO_FACE_COLOR);
        ST7735_FillRect(95, 40, 35, 5, BMO_FACE_COLOR);
    } else {
        ST7735_FillRect(35, 25, 25, 25, BMO_FACE_COLOR);
        ST7735_FillRect(100, 25, 25, 25, BMO_FACE_COLOR);
        ST7735_FillRect(42, 30, 10, 10, COLOR_WHITE);
        ST7735_FillRect(107, 30, 10, 10, COLOR_WHITE);
    }

    switch (expression) {
        case 0:
            ST7735_FillRect(55, 70, 50, 5, BMO_FACE_COLOR);
            break;
        case 1:
            ST7735_FillRect(50, 75, 60, 5, BMO_FACE_COLOR);
            ST7735_FillRect(42, 70, 12, 5, BMO_FACE_COLOR);
            ST7735_FillRect(106, 70, 12, 5, BMO_FACE_COLOR);
            ST7735_FillRect(36, 64, 10, 6, BMO_FACE_COLOR);
            ST7735_FillRect(114, 64, 10, 6, BMO_FACE_COLOR);
            break;
        case 2:
            ST7735_FillRect(50, 65, 60, 25, BMO_FACE_COLOR);
            ST7735_FillRect(56, 72, 48, 14, BMO_SCREEN_COLOR);
            ST7735_FillRect(65, 78, 30, 6, COLOR_RED);
            break;
        case 3:
            ST7735_FillRect(35, 25, 25, 25, BMO_FACE_COLOR);
            ST7735_FillRect(42, 30, 10, 10, COLOR_WHITE);
            ST7735_FillRect(95, 40, 35, 5, BMO_FACE_COLOR);
            ST7735_FillRect(50, 75, 60, 5, BMO_FACE_COLOR);
            ST7735_FillRect(42, 70, 12, 5, BMO_FACE_COLOR);
            ST7735_FillRect(106, 70, 12, 5, BMO_FACE_COLOR);
            break;
    }
}

void PlayIntroAnimation(void) {
    int16_t ball_x = 80, ball_y = 82;
    int16_t ball_dx = 2, ball_dy = 1;
    int16_t p1_y = 72, p2_y = 72;
    const uint8_t BALL_SZ = 5;
    const uint8_t PAD_W = 4, PAD_H = 18;
    const int16_t DEMO_TOP = 66;
    const int16_t DEMO_BOTTOM = 102;
    uint32_t anim_start;

    /* === LED-uri la start intro === */
    LED_BothFlash(2, 100, 100);

    /* === Porneste melodia "The Metro" === */
    PRINTF("Playing intro melody...\r\n");

    /* Faza BMO */
    ST7735_FillScreen(BMO_SCREEN_COLOR);
    delay_ms(300);

    DrawBMOFace(0, 0);
    LED_BothFlash(1, 80, 0);  // Flash la aparitia BMO
    delay_ms(420);

    DrawBMOFace(0, 1);
    delay_ms(150);
    DrawBMOFace(0, 0);
    delay_ms(300);

    ST7735_DrawStringCentered(100, "Hi!", COLOR_BLACK, BMO_SCREEN_COLOR, 2);
    delay_ms(600);

