TanaseDoru/FRDM_Pong/TestProjects/MKL25Z4_Display_My_test/source/MKL25Z4_Display_My_test.c
    DrawBMOFace(1, 0);
    delay_ms(400);

    ST7735_FillRect(40, 95, 80, 25, BMO_SCREEN_COLOR);
    ST7735_DrawStringCentered(100, "Let's play", COLOR_BLACK, BMO_SCREEN_COLOR, 1);
    delay_ms(500);

    DrawBMOFace(2, 0);
    ST7735_DrawStringCentered(112, "PONG!", COLOR_YELLOW, BMO_SCREEN_COLOR, 2);
    delay_ms(800);

    DrawBMOFace(2, 1);
    delay_ms(150);
    DrawBMOFace(2, 0);
    delay_ms(200);

    DrawBMOFace(3, 0);
    delay_ms(400);

    DrawBMOFace(1, 0);
    ST7735_DrawStringCentered(100, "Let's play", COLOR_BLACK, BMO_SCREEN_COLOR, 1);
    ST7735_DrawStringCentered(112, "PONG!", COLOR_YELLOW, BMO_SCREEN_COLOR, 2);
    delay_ms(1000);

    for (int i = 0; i < 3; i++) {
        ST7735_FillScreen(COLOR_WHITE);
        LEDS_BOTH_ON();  // LED flash sincronizat cu ecranul
        delay_ms(50);
        ST7735_FillScreen(BMO_SCREEN_COLOR);
        LEDS_BOTH_OFF();
        DrawBMOFace(1, 0);
        ST7735_DrawStringCentered(100, "Let's play", COLOR_BLACK, BMO_SCREEN_COLOR, 1);
        ST7735_DrawStringCentered(112, "PONG!", COLOR_YELLOW, BMO_SCREEN_COLOR, 2);
        delay_ms(100);
    }

    delay_ms(200);

    anim_start = Timer_GetMs();

    /* Rainbow scanlines cu LED-uri pulsand */
    for (int16_t y = 0; y < 128; y += 2) {
        uint16_t scan_color = rainbow_colors[y % NUM_RAINBOW_COLORS];
        ST7735_DrawHLine(0, y, 160, scan_color);
        // LED-uri alternand in timpul scanlines
        if (y % 16 == 0) LED_P1_TOGGLE();
        if (y % 16 == 8) LED_P2_TOGGLE();
        delay_ms(8);
    }
    LEDS_BOTH_OFF();
    delay_ms(100);

    /* Flash de culori cu LED-uri sincronizate */
    ST7735_FillScreen(COLOR_CYAN);
    LED_P1_ON();
    delay_ms(40);
    ST7735_FillScreen(COLOR_MAGENTA);
    LED_P1_OFF(); LED_P2_ON();
    delay_ms(40);
    ST7735_FillScreen(COLOR_YELLOW);
    LEDS_BOTH_ON();
    delay_ms(40);
    ST7735_FillScreen(COLOR_WHITE);
    delay_ms(60);
    LEDS_BOTH_OFF();

    for (int16_t y = 0; y < 128; y++) {
        uint8_t intensity = 10 + (y / 8);
        uint16_t grad_color = ((intensity >> 3) << 11);
        ST7735_DrawHLine(0, y, 160, grad_color);
    }
    delay_ms(100);

    for (int i = 0; i < 4; i++) {
        ST7735_DrawRect(78 - i*20, 62 - i*16, 4 + i*40, 4 + i*32, rainbow_colors[i % NUM_RAINBOW_COLORS]);
        delay_ms(60);
    }
    delay_ms(100);

    ST7735_FillRect(6, 6, 148, 116, COLOR_BLACK);
    ST7735_DrawRect(4, 4, 152, 120, COLOR_WHITE);
    ST7735_DrawRect(6, 6, 148, 116, COLOR_GRAY);

    delay_ms(150);

    const char* letters = "PONG";
    int16_t letter_x[] = {26, 54, 82, 110};
    uint16_t letter_colors[] = {COLOR_CYAN, COLOR_YELLOW, COLOR_MAGENTA, COLOR_GREEN};
    const uint8_t TITLE_SIZE = 3;

    for (uint8_t size = 1; size <= TITLE_SIZE; size++) {
        for (int i = 0; i < 4; i++) {
            int16_t offset = (TITLE_SIZE - size) * 4;
            ST7735_DrawChar(letter_x[i] + offset, 15 + offset, letters[i],
                           letter_colors[i], COLOR_BLACK, size);
        }
        delay_ms(80);
        if (size < TITLE_SIZE) {
            ST7735_FillRect(20, 10, 120, 40, COLOR_BLACK);
        }
    }

    /* Flash titlu PONG cu LED-uri */
    for (int flash = 0; flash < 3; flash++) {
        for (int i = 0; i < 4; i++) {
            ST7735_DrawChar(letter_x[i], 15, letters[i],
                           rainbow_colors[(flash + i) % NUM_RAINBOW_COLORS], COLOR_BLACK, TITLE_SIZE);
        }
        LED_P1_TOGGLE(); LED_P2_TOGGLE();  // LED-uri alternand cu titlul
        delay_ms(80);
    }
    LEDS_BOTH_OFF();

    for (int i = 0; i < 4; i++) {
        ST7735_DrawChar(letter_x[i], 15, letters[i], letter_colors[i], COLOR_BLACK, TITLE_SIZE);
    }
    LED_BothFlash(2, 50, 50);  // Flash final la titlu complet

    for (int16_t w = 0; w <= 70; w += 3) {
        ST7735_DrawHLine(80 - w, 42, w * 2, COLOR_WHITE);
        if (w > 10) {
            ST7735_DrawHLine(80 - w + 5, 43, (w - 5) * 2, COLOR_GRAY);
        }
        delay_ms(6);
    }

    delay_ms(100);

    const char* subtitle = "ARCADE EDITION";
    char typing_buf[20] = "";
    for (int i = 0; subtitle[i] != '\0'; i++) {
        typing_buf[i] = subtitle[i];
        typing_buf[i+1] = '\0';
        ST7735_FillRect(30, 48, 100, 12, COLOR_BLACK);
        ST7735_DrawStringCentered(50, typing_buf, COLOR_ORANGE, COLOR_BLACK, 1);
        delay_ms(40);
    }

    ST7735_DrawStringCentered(50, subtitle, COLOR_WHITE, COLOR_BLACK, 1);
    delay_ms(80);
    ST7735_DrawStringCentered(50, subtitle, COLOR_ORANGE, COLOR_BLACK, 1);

    delay_ms(200);

    ST7735_DrawHLine(15, 62, 130, COLOR_DARK_GRAY);
    ST7735_DrawHLine(15, 105, 130, COLOR_DARK_GRAY);

    ST7735_FillRect(8, p1_y, PAD_W, PAD_H, COLOR_CYAN);
    ST7735_FillRect(148, p2_y, PAD_W, PAD_H, COLOR_MAGENTA);

    ST7735_DrawStringCentered(112, "Press to Start", COLOR_WHITE, COLOR_BLACK, 1);
    ST7735_DrawStringCentered(120, ">> PUSH <<", COLOR_GRAY, COLOR_BLACK, 1);

    PRINTF("Intro animation started\r\n");

    g_joy_btn_pressed = false;
    uint8_t border_color_idx = 0;
    uint32_t last_border_update = 0;
    uint8_t title_glow = 0;
    uint32_t last_title_glow = 0;
    uint8_t blink_state = 0;
    uint32_t last_blink = 0;

    while (!g_joy_btn_pressed && !IR_IsPausePressed()) {
        uint32_t now = Timer_GetMs();


        ST7735_FillRect(ball_x, ball_y, BALL_SZ, BALL_SZ, COLOR_BLACK);

        ball_x += ball_dx;
        ball_y += ball_dy;

        if (ball_y <= DEMO_TOP || ball_y >= DEMO_BOTTOM - BALL_SZ) {
            ball_dy = -ball_dy;
        }
        if (ball_x <= 12 && ball_y + BALL_SZ >= p1_y && ball_y <= p1_y + PAD_H) {
            ball_dx = -ball_dx;
            ball_x = 13;
            ST7735_FillRect(8, p1_y, PAD_W, PAD_H, COLOR_WHITE);
            LED_P1_ON();  // LED P1 flash la coliziune demo
        }
        if (ball_x >= 148 - BALL_SZ && ball_y + BALL_SZ >= p2_y && ball_y <= p2_y + PAD_H) {
            ball_dx = -ball_dx;
            ball_x = 147 - BALL_SZ;
            ST7735_FillRect(148, p2_y, PAD_W, PAD_H, COLOR_WHITE);
            LED_P2_ON();  // LED P2 flash la coliziune demo
        }

        if (ball_x < 5 || ball_x > 155) {
            ball_x = 80;
            ball_y = 82;
            ball_dx = (ball_dx > 0) ? -2 : 2;
        }

        ST7735_FillRect(8, p1_y, PAD_W, PAD_H, COLOR_BLACK);
        if (ball_y > p1_y + PAD_H/2) p1_y += 2;
        else if (ball_y < p1_y + PAD_H/2) p1_y -= 2;
        if (p1_y < DEMO_TOP) p1_y = DEMO_TOP;
        if (p1_y > DEMO_BOTTOM - PAD_H) p1_y = DEMO_BOTTOM - PAD_H;
        ST7735_FillRect(8, p1_y, PAD_W, PAD_H, COLOR_CYAN);
        LED_P1_OFF();  // Opreste LED dupa redraw paleta

        ST7735_FillRect(148, p2_y, PAD_W, PAD_H, COLOR_BLACK);
        if (ball_y > p2_y + PAD_H/2) p2_y += 2;
        else if (ball_y < p2_y + PAD_H/2) p2_y -= 2;
        if (p2_y < DEMO_TOP) p2_y = DEMO_TOP;
        if (p2_y > DEMO_BOTTOM - PAD_H) p2_y = DEMO_BOTTOM - PAD_H;
        ST7735_FillRect(148, p2_y, PAD_W, PAD_H, COLOR_MAGENTA);
        LED_P2_OFF();  // Opreste LED dupa redraw paleta

        uint16_t ball_color = rainbow_colors[(now / 200) % NUM_RAINBOW_COLORS];
        ST7735_FillRect(ball_x, ball_y, BALL_SZ, BALL_SZ, ball_color);

        if ((now - last_border_update) >= 150) {
            last_border_update = now;
            border_color_idx = (border_color_idx + 1) % NUM_RAINBOW_COLORS;
            ST7735_DrawRect(4, 4, 152, 120, rainbow_colors[border_color_idx]);
        }

