TanaseDoru/FRDM_Pong/TestProjects/MKL25Z4_Display_My_test/source/MKL25Z4_Display_My_test.c
        if ((now - last_title_glow) >= 200) {
            last_title_glow = now;
            title_glow = (title_glow + 1) % NUM_RAINBOW_COLORS;

            for (int i = 0; i < 4; i++) {
                uint8_t color_idx = (title_glow + i * 2) % NUM_RAINBOW_COLORS;
                uint16_t letter_col;
                if ((title_glow / 2) % 2 == 0) {
                    letter_col = rainbow_colors[color_idx];
                } else {
                    uint16_t orig_colors[] = {COLOR_CYAN, COLOR_YELLOW, COLOR_MAGENTA, COLOR_GREEN};
                    letter_col = orig_colors[i];
                }
                ST7735_DrawChar(letter_x[i], 15, letters[i], letter_col, COLOR_BLACK, TITLE_SIZE);
            }
        }

        if ((now - last_blink) >= 400) {
            last_blink = now;
            blink_state = (blink_state + 1) % 4;
            uint16_t blink_colors[] = {COLOR_WHITE, COLOR_YELLOW, COLOR_CYAN, COLOR_MAGENTA};
            ST7735_DrawStringCentered(112, "Press to Start", blink_colors[blink_state], COLOR_BLACK, 1);
        }

        delay_ms(33);

        if ((now - anim_start) > 60000) {
            PRINTF("Intro timeout\r\n");
            break;
        }
    }

    PRINTF("Button pressed - going to menu\r\n");

    /* === Opreste melodia === */
    Buzzer_Off();

    for (int i = 0; i < 5; i++) {
        ST7735_DrawRect(i * 15, i * 12, 160 - i * 30, 128 - i * 24, COLOR_WHITE);
        delay_ms(30);
    }

    ST7735_FillScreen(COLOR_CYAN);
    delay_ms(30);
    ST7735_FillScreen(COLOR_WHITE);
    delay_ms(50);
    ST7735_FillScreen(COLOR_BLACK);
    delay_ms(80);

    g_joy_btn_pressed = false;
}

void DrawCurrentScreen(void) {
    switch (g_currentScreen) {
        case SCREEN_INTRO:
            PlayIntroAnimation();
            g_currentScreen = SCREEN_MAIN;
            g_menuState.selectedIndex = 0;
            g_needsRedraw = 1;
            DrawMainScreen();
            break;
        case SCREEN_MAIN:
            g_menuState.maxItems = 2;
            DrawMainScreen();
            break;
        case SCREEN_START:
            g_menuState.maxItems = 3;
            DrawStartScreen();
            break;
        case SCREEN_SELECT_INPUT:
            g_menuState.maxItems = 3;
            DrawSelectInputScreen();
            break;
        case SCREEN_SELECT_P1:
            g_menuState.maxItems = 4;
            DrawSelectP1Screen();
            break;
        case SCREEN_SELECT_P2:
            g_menuState.maxItems = 4;
            DrawSelectP2Screen();
            break;
        case SCREEN_DIFFICULTY:
            g_menuState.maxItems = 4;
            DrawDifficultyScreen();
            break;
        case SCREEN_GAMEPLAY:
            break;
        case SCREEN_GAME_OVER:
            g_menuState.maxItems = 2;
            DrawGameOverScreen();
            break;
        case SCREEN_PAUSED:
            DrawPausedScreen();
            break;
    }
    g_needsRedraw = 0;
}

/*============================================================================
 * NAVIGARE MENIU
 *============================================================================*/

void Menu_MoveUp(void) {
    if (g_menuState.selectedIndex > 0) g_menuState.selectedIndex--;
    else g_menuState.selectedIndex = g_menuState.maxItems - 1;
    g_needsRedraw = 1;
}

void Menu_MoveDown(void) {
    g_menuState.selectedIndex++;
    if (g_menuState.selectedIndex >= g_menuState.maxItems) g_menuState.selectedIndex = 0;
    g_needsRedraw = 1;
}

void ChangeScreen(Screen_t newScreen) {
    g_currentScreen = newScreen;
    g_menuState.selectedIndex = 0;
    g_needsRedraw = 1;
}

void Menu_Select(void) {
    switch (g_currentScreen) {
        case SCREEN_MAIN:
            switch (g_menuState.selectedIndex) {
                case 0: ChangeScreen(SCREEN_START); break;
                case 1: ChangeScreen(SCREEN_SELECT_INPUT); break;
                case 2: PRINTF("Mute Music toggled\r\n"); break;
            }
            break;

        case SCREEN_START:
            switch (g_menuState.selectedIndex) {
                case 0:
                    PRINTF("Starting PvP game!\r\n");
                    if (IsCPUInput(g_player2_input)) g_player2_input = INPUT_REMOTE;
                    if (g_player1_input == g_player2_input && !IsCPUInput(g_player1_input)) g_player2_input = INPUT_REMOTE;
                    Game_Start();
                    break;
                case 1: ChangeScreen(SCREEN_DIFFICULTY); break;
                case 2: ChangeScreen(SCREEN_MAIN); break;
            }
            break;

        case SCREEN_DIFFICULTY:
            switch (g_menuState.selectedIndex) {
                case 0: g_player2_input = INPUT_CPU_EASY; Game_Start(); break;
                case 1: g_player2_input = INPUT_CPU_MEDIUM; Game_Start(); break;
                case 2: g_player2_input = INPUT_CPU_HARD; Game_Start(); break;
                case 3: ChangeScreen(SCREEN_START); break;
            }
            break;

        case SCREEN_SELECT_INPUT:
            switch (g_menuState.selectedIndex) {
                case 0: ChangeScreen(SCREEN_SELECT_P1); break;
                case 1: ChangeScreen(SCREEN_SELECT_P2); break;
                case 2: ChangeScreen(SCREEN_MAIN); break;
            }
            break;

        case SCREEN_SELECT_P1:
            if (g_menuState.selectedIndex == 3) {
                ChangeScreen(SCREEN_SELECT_INPUT);
            } else {
                InputType_t inputMap[] = {INPUT_JOYSTICK, INPUT_REMOTE, INPUT_GYROSCOPE};
                InputType_t selectedInput = inputMap[g_menuState.selectedIndex];

                if (IsInputAvailable(selectedInput, 1)) {
                    g_player1_input = selectedInput;
                    g_currentScreen = SCREEN_SELECT_INPUT;
                    g_menuState.selectedIndex = 1;
                    g_needsRedraw = 1;
                } else {
                    ST7735_FillRect(20, 105, 120, 20, COLOR_RED);
                    ST7735_DrawRect(20, 105, 120, 20, COLOR_WHITE);
                    ST7735_DrawStringCentered(110, "USED BY P2!", COLOR_WHITE, COLOR_RED, 1);
                    delay_ms(800);
                    g_needsRedraw = 1;
                }
            }
            break;

