TanaseDoru/FRDM_Pong/TestProjects/MKL25Z4_Display_My_test/source/MKL25Z4_Display_My_test.c
    PRINTF("=== CONTROLS ===\r\n");
    PRINTF("MENU: Joystick/IR UP/DOWN + Button/OK=Select\r\n");
    PRINTF("GAME: Joystick/IR UP/DOWN = Move paddle\r\n");
    PRINTF("      Button/OK = Pause\r\n");
    PRINTF("      IR: Hold UP/DOWN for continuous move\r\n");
    PRINTF("================\r\n\r\n");

    DrawCurrentScreen();

    PRINTF(">>> Ready! <<<\r\n\r\n");

    while (1) {
        Joystick_Process();

        if (Gyro_Check_UART_Data()) {
			Gyro_Process_Data(g_gyro_rx_buffer);   // => PRINTF "Inclinatie: ..."
		}



        if (g_currentScreen == SCREEN_GAMEPLAY) {

            ProcessGameInput();

            if (g_game_tick) {
            	g_game_tick = 0;

                Game_Update();

                if (!game.is_running && game.winner != 0) {
                    PRINTF("\r\n=== GAME OVER ===\r\n");
                    PRINTF("Winner: Player %d\r\n", game.winner);
                    PRINTF("Score: %d - %d\r\n\r\n", paddle1.score, paddle2.score);

                    g_currentScreen = SCREEN_GAME_OVER;
                    g_menuState.selectedIndex = 0;
                    g_needsRedraw = 1;
                }

                g_p1_move = 0;
                g_p2_move = 0;
            }

            UI_PrintStats();

        } else if (g_currentScreen == SCREEN_PAUSED) {
            ProcessGameInput();

            if (g_needsRedraw) {
                DrawCurrentScreen();
            }

        } else {
            if (g_menu_tick) {
            	g_menu_tick = 0;
                ProcessMenuInput();
            }

            if (g_needsRedraw) {
                DrawCurrentScreen();
            }
        }

//        __WFI();
    }

    return 0;
}
